number_in = {'один': 1,         'два': 2,             'три': 3,          'четыре': 4,         'пять': 5,           'шесть': 6,        'семь': 7,
             'восемь': 8,       'девять': 9,          'десять': 10,      'одиннадцать': 11,   'двенадцать': 12,    'тринадцать': 13,  'четырнадцать': 14,
             'пятнадцать': 15,  'шестнадцать': 16,    'семнадцать': 17,  'восемнадцать': 18,  'девятнадцать': 19,  'двадцать': 20,    'тридцать': 30,
             'сорок': 40,       'пятьдесят': 50,      'шестьдесят': 60,  'семьдесят': 70,     'восемьдесят': 80,   'девяносто': 90,   'сто': 100,
             'двести': 200,     'триста': 300,        'четыреста': 400,  'пятьсот': 500,      'шестьсот': 600,     'семьсот': 700,    'восемьсот': 800,
             'девятьсот': 900,  'одна тысяча': 10**3, 'тысячи': 10**3,   'миллион': 10**6,    'миллиард': 10**9,   'триллион': 10**12}

number_out = {1: 'один',         2: 'два',             3: 'три',            4: 'четыре',         5: 'пять',           6: 'шесть',        7: 'семь',
              8: 'восемь',       9: 'девять',          10: 'десять',        11: 'одиннадцать',   12: 'двенадцать',    13: 'тринадцать',  14: 'четырнадцать',
              15: 'пятнадцать',  16: 'шестнадцать',    17: 'семнадцать',    18: 'восемнадцать',  19: 'девятнадцать',  20: 'двадцать',    30: 'тридцать',
              40: 'сорок',       50: 'пятьдесят',      60: 'шестьдесят',    70: 'семьдесят',     80: 'восемьдесят',   90: 'девяносто',   100: 'сто',
              200: 'двести',     300: 'триста',        400: 'четыреста',    500: 'пятьсот',      600: 'шестьсот',     700: 'семьсот',    800: 'восемьсот',
              900: 'девятьсот',  10**3: 'одна тысяча', 10**3: 'тысячи',     10**6: 'миллион',    10**9: 'миллиард',   10**12: 'триллион'}